# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'yq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager

# Apps
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'visual-studio-code'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
#mas 'Byword', id: 420212497
#mas 'Giphy Capture', id: 668208984
#mas 'Keynote', id: 409183694
#mas 'MyWoosh', id: 1498889644
#mas 'Numbers', id: 409203825
#mas 'Speedtest', id: 1153157709
#mas 'Spring', id: 1508706541
#mas 'Things', id: 904280696
